Revit 2027 API
BuiltInFailures.StairRampFailures.HeightOfRunIsTooSmall Property
 Height of run is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HeightOfRunIsTooSmall { get; }
Public Shared ReadOnly Property HeightOfRunIsTooSmall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HeightOfRunIsTooSmall {
	FailureDefinitionId^ get ();
}
static member HeightOfRunIsTooSmall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace